Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# DataOp_Kind_WordSwap32
source: Swap 16-bit words (within 32 bit)
ar: تبديل كلمات 16 بت (ضمن 32 بت)
cs: Prohození 16bitových slov (v rámci 32 bitů)
de: 16-Bit-Wörter tauschen (innerhalb von 32 Bit)
el: Αντιμετάθεση λέξεων 16 bit (εντός 32 bit)
es: Intercambiar palabras de 16 bits (dentro de 32 bits)
fa: جابه‌جایی کلمه‌های 16 بیتی (درون 32 بیت)
fr: Permuter les mots de 16 bits (dans 32 bits)
hu: 16 bites szavak cseréje (32 biten belül)
id: Tukar word 16-bit (dalam 32-bit)
it: Scambia parole a 16 bit (in 32 bit)
ja: 16 bit ワードのスワップ (32 bit 内)
ko: 16비트 워드 스왑(32비트 내)
pl: Zamień słowa 16-bitowe (w obrębie 32 bitów)
pt: Trocar palavras de 16 bits (em 32 bits)
ro: Interschimbare cuvinte de 16 biți (în 32 de biți)
th: สลับเวิร์ด 16 บิต (ภายใน 32 บิต)
tr: 16 bitlik sözcükleri takas et (32 bit içinde)
uk: Перестановка 16-бітових слів (у межах 32 біт)
vi: Hoán đổi word 16 bit (trong 32 bit)
zh_hans: 交换 16 位字（32 位内）
zh_hant: 交換 16 位元字組（32 位元內）

# Cmd_data_op_wordSwap32
source: Swap 16-bit words (within 32 bit)
ar: تبديل كلمات 16 بت (ضمن 32 بت)
cs: Prohození 16bitových slov (v rámci 32 bitů)
de: 16-Bit-Wörter tauschen (innerhalb von 32 Bit)
el: Αντιμετάθεση λέξεων 16 bit (εντός 32 bit)
es: Intercambiar palabras de 16 bits (dentro de 32 bits)
fa: جابه‌جایی کلمه‌های 16 بیتی (درون 32 بیت)
fr: Permuter les mots de 16 bits (dans 32 bits)
hu: 16 bites szavak cseréje (32 biten belül)
id: Tukar word 16-bit (dalam 32-bit)
it: Scambia parole a 16 bit (in 32 bit)
ja: 16 bit ワードのスワップ (32 bit 内)
ko: 16비트 워드 스왑(32비트 내)
pl: Zamień słowa 16-bitowe (w obrębie 32 bitów)
pt: Trocar palavras de 16 bits (em 32 bits)
ro: Interschimbare cuvinte de 16 biți (în 32 de biți)
th: สลับเวิร์ด 16 บิต (ภายใน 32 บิต)
tr: 16 bitlik sözcükleri takas et (32 bit içinde)
uk: Перестановка 16-бітових слів (у межах 32 біт)
vi: Hoán đổi word 16 bit (trong 32 bit)
zh_hans: 交换 16 位字（32 位内）
zh_hant: 交換 16 位元字組（32 位元內）

# CmdAlias_data_op_wordSwap32
source: swap 16-bit words (within 32 bit)
ar: swap 16-bit words (within 32 bit) تبديل كلمات
cs: prohodit prohození prohozeni slova swap 16-bit words (within 32 bit)
de: wörter tauschen swap 16-bit words (within 32 bit)
el: αντιμετάθεση λέξεων swap 16-bit words (within 32 bit)
es: intercambiar palabras swap 16-bit words (within 32 bit)
fa: جابه‌جایی کلمه‌ها, swap 16-bit words (within 32 bit)
fr: permuter mots swap 16-bit words (within 32 bit)
hu: szócsere szocsere szavak cseréje csereje swap 16-bit words (within 32 bit)
id: tukar word swap 16-bit words (within 32 bit)
it: scambia parole word swap 16-bit words (within 32 bit)
ja: わーどのすわっぷ
ko: 워드 스왑 교환 swap 16-bit words (within 32 bit)
pl: zamień słowa word swap 16-bit words (within 32 bit)
pt: trocar palavras word swap 16-bit words (within 32 bit)
ro: interschimbare cuvinte cuvânt cuvant swap 16-bit words (within 32 bit)
th: สลับเวิร์ด swap 16-bit words (within 32 bit)
tr: sözcük takası swap 16-bit words (within 32 bit)
uk: перестановка слів swap 16-bit words (within 32 bit)
vi: hoán đổi word swap 16-bit words (within 32 bit)
zh_hans: 字交换 交换 swap 16-bit words (within 32 bit)
zh_hant: 字組交換 swap 16-bit words (within 32 bit)

# DataOp_Kind_ReverseRange
source: Reverse byte order
ar: عكس ترتيب البايتات
cs: Obrátit pořadí bajtů
de: Bytereihenfolge umkehren
el: Αντιστροφή σειράς byte
es: Invertir el orden de los bytes
fa: وارونه کردن ترتیب بایت
fr: Inverser l'ordre des octets
hu: Bájtsorrend megfordítása
id: Balik urutan byte
it: Inverti ordine dei byte
ja: バイト順を反転
ko: 바이트 순서 반전
pl: Odwróć kolejność bajtów
pt: Inverter ordem dos bytes
ro: Inversare ordine octeți
th: กลับลำดับไบต์
tr: Bayt sırasını ters çevir
uk: Зворотний порядок байтів
vi: Đảo thứ tự byte
zh_hans: 反转字节顺序
zh_hant: 反轉位元組順序

# Cmd_data_op_reverseRange
source: Reverse byte order
ar: عكس ترتيب البايتات
cs: Obrátit pořadí bajtů
de: Bytereihenfolge umkehren
el: Αντιστροφή σειράς byte
es: Invertir el orden de los bytes
fa: وارونه کردن ترتیب بایت
fr: Inverser l'ordre des octets
hu: Bájtsorrend megfordítása
id: Balik urutan byte
it: Inverti ordine dei byte
ja: バイト順を反転
ko: 바이트 순서 반전
pl: Odwróć kolejność bajtów
pt: Inverter ordem dos bytes
ro: Inversare ordine octeți
th: กลับลำดับไบต์
tr: Bayt sırasını ters çevir
uk: Зворотний порядок байтів
vi: Đảo thứ tự byte
zh_hans: 反转字节顺序
zh_hant: 反轉位元組順序

# CmdAlias_data_op_reverseRange
source: reverse byte order
ar: reverse byte order عكس ترتيب البايتات
cs: obrátit obratit pořadí poradi bajtů bajtu reverse byte order
de: umkehren rückwärts reverse byte order
el: αντιστροφή σειράς byte reverse byte order
es: invertir orden reverse byte order
fa: وارونه کردن ترتیب بایت, reverse byte order
fr: inverser ordre reverse byte order
hu: bájtsorrend bajtsorrend megfordítás megforditas fordított forditott reverse byte order
id: balik urutan terbalik reverse byte order
it: inverti ordine dei byte al contrario reverse byte order
ja: ばいとじゅんをはんてん ぎゃくじゅん
ko: 바이트 순서 반전 역순 뒤집기 reverse byte order
pl: odwróć kolejność bajtów wspak reverse byte order
pt: inverter ordem dos bytes ao contrário reverse byte order
ro: inversare ordine octeți octeti invers reverse byte order
th: กลับลำดับ ย้อนกลับ reverse byte order
tr: bayt sırası ters reverse byte order
uk: зворотний порядок байтів reverse byte order
vi: đảo ngược thứ tự reverse byte order
zh_hans: 反转 字节顺序 倒序 reverse byte order
zh_hant: 反轉位元組順序 倒序 reverse byte order

# DataOp_Kind_ReverseBits
source: Reverse bit order (each byte)
ar: عكس ترتيب البتات (كل بايت)
cs: Obrátit pořadí bitů (každý bajt)
de: Bitreihenfolge umkehren (je Byte)
el: Αντιστροφή σειράς bit (κάθε byte)
es: Invertir el orden de los bits (cada byte)
fa: وارونه کردن ترتیب بیت (هر بایت)
fr: Inverser l'ordre des bits (chaque octet)
hu: Bitsorrend megfordítása (bájtonként)
id: Balik urutan bit (setiap byte)
it: Inverti ordine dei bit (ogni byte)
ja: ビット順の反転 (各バイト)
ko: 비트 순서 반전(각 바이트)
pl: Odwróć kolejność bitów (każdy bajt)
pt: Inverter ordem dos bits (cada byte)
ro: Inversare ordine biți (fiecare octet)
th: กลับลำดับบิต (แต่ละไบต์)
tr: Bit sırasını ters çevir (her bayt)
uk: Зворотний порядок бітів (у кожному байті)
vi: Đảo thứ tự bit (mỗi byte)
zh_hans: 反转位顺序（每个字节）
zh_hant: 反轉位元順序（每個位元組）

# Cmd_data_op_reverseBits
source: Reverse bit order (each byte)
ar: عكس ترتيب البتات (كل بايت)
cs: Obrátit pořadí bitů (každý bajt)
de: Bitreihenfolge umkehren (je Byte)
el: Αντιστροφή σειράς bit (κάθε byte)
es: Invertir el orden de los bits (cada byte)
fa: وارونه کردن ترتیب بیت (هر بایت)
fr: Inverser l'ordre des bits (chaque octet)
hu: Bitsorrend megfordítása (bájtonként)
id: Balik urutan bit (setiap byte)
it: Inverti ordine dei bit (ogni byte)
ja: ビット順の反転 (各バイト)
ko: 비트 순서 반전(각 바이트)
pl: Odwróć kolejność bitów (każdy bajt)
pt: Inverter ordem dos bits (cada byte)
ro: Inversare ordine biți (fiecare octet)
th: กลับลำดับบิต (แต่ละไบต์)
tr: Bit sırasını ters çevir (her bayt)
uk: Зворотний порядок бітів (у кожному байті)
vi: Đảo thứ tự bit (mỗi byte)
zh_hans: 反转位顺序（每个字节）
zh_hant: 反轉位元順序（每個位元組）

# CmdAlias_data_op_reverseBits
source: reverse bit order (each byte)
ar: reverse bit order (each byte) عكس ترتيب البتات
cs: obrátit obratit pořadí poradi bitů bitu reverse bit order (each byte)
de: bits umkehren reverse bit order (each byte)
el: αντιστροφή σειράς bit reverse bit order (each byte)
es: invertir bits reverse bit order (each byte)
fa: وارونه کردن ترتیب بیت, reverse bit order (each byte)
fr: inverser bits reverse bit order (each byte)
hu: bitsorrend megfordítás megforditas tükrözés tukrozes reverse bit order (each byte)
id: balik urutan bit reverse bit order (each byte)
it: inverti ordine bit ogni byte reverse bit order (each byte)
ja: びっとじゅんのはんてん
ko: 비트 순서 반전 역순 뒤집기 reverse bit order (each byte)
pl: odwróć kolejność bitów każdy bajt reverse bit order (each byte)
pt: inverter ordem bits cada byte reverse bit order (each byte)
ro: inversare ordine biți biti reverse bit order (each byte)
th: กลับลำดับบิต reverse bit order (each byte)
tr: bit sırası ters reverse bit order (each byte)
uk: зворотний порядок бітів reverse bit order (each byte)
vi: đảo thứ tự bit reverse bit order (each byte)
zh_hans: 反转 位顺序 reverse bit order (each byte)
zh_hant: 反轉位元順序 reverse bit order (each byte)

# DataOp_Kind_SwapNibbles
source: Swap nibbles (each byte)
ar: تبديل أنصاف البايتات (كل بايت)
cs: Prohodit nibbly (každý bajt)
de: Nibbles tauschen (je Byte)
el: Αντιμετάθεση nibble (κάθε byte)
es: Intercambiar nibbles (cada byte)
fa: جابه‌جایی نیم‌بایت‌ها (هر بایت)
fr: Permuter les quartets (chaque octet)
hu: Félbájtok cseréje (bájtonként)
id: Tukar nibble (setiap byte)
it: Scambia nibble (ogni byte)
ja: ニブルの入れ替え (各バイト)
ko: 니블 교환(각 바이트)
pl: Zamień półbajty (każdy bajt)
pt: Trocar nibbles (cada byte)
ro: Interschimbare nibble (fiecare octet)
th: สลับนิบเบิล (แต่ละไบต์)
tr: Yarım baytları takas et (her bayt)
uk: Перестановка півбайтів (у кожному байті)
vi: Hoán đổi nibble (mỗi byte)
zh_hans: 交换半字节（每个字节）
zh_hant: 交換半位元組（每個位元組）

# Cmd_data_op_swapNibbles
source: Swap nibbles (each byte)
ar: تبديل أنصاف البايتات (كل بايت)
cs: Prohodit nibbly (každý bajt)
de: Nibbles tauschen (je Byte)
el: Αντιμετάθεση nibble (κάθε byte)
es: Intercambiar nibbles (cada byte)
fa: جابه‌جایی نیم‌بایت‌ها (هر بایت)
fr: Permuter les quartets (chaque octet)
hu: Félbájtok cseréje (bájtonként)
id: Tukar nibble (setiap byte)
it: Scambia nibble (ogni byte)
ja: ニブルの入れ替え (各バイト)
ko: 니블 교환(각 바이트)
pl: Zamień półbajty (każdy bajt)
pt: Trocar nibbles (cada byte)
ro: Interschimbare nibble (fiecare octet)
th: สลับนิบเบิล (แต่ละไบต์)
tr: Yarım baytları takas et (her bayt)
uk: Перестановка півбайтів (у кожному байті)
vi: Hoán đổi nibble (mỗi byte)
zh_hans: 交换半字节（每个字节）
zh_hant: 交換半位元組（每個位元組）

# CmdAlias_data_op_swapNibbles
source: swap nibbles (each byte)
ar: swap nibbles (each byte) تبديل أنصاف البايتات
cs: prohodit nibbly půlbajty pulbajty swap nibbles (each byte)
de: nibbles tauschen swap nibbles (each byte)
el: αντιμετάθεση nibble swap nibbles (each byte)
es: intercambiar nibbles swap nibbles (each byte)
fa: جابه‌جایی نیم‌بایت‌ها, swap nibbles (each byte)
fr: permuter quartets swap nibbles (each byte)
hu: félbájt felbajt csere swap nibbles (each byte)
id: tukar nibble swap nibbles (each byte)
it: scambia nibble ogni byte swap nibbles (each byte)
ja: にぶるのいれかえ
ko: 니블 교환 스왑 swap nibbles (each byte)
pl: zamień półbajty każdy bajt swap nibbles (each byte)
pt: trocar nibbles cada byte swap nibbles (each byte)
ro: interschimbare nibble semioctet swap nibbles (each byte)
th: สลับนิบเบิล swap nibbles (each byte)
tr: yarım bayt takası swap nibbles (each byte)
uk: перестановка півбайтів swap nibbles (each byte)
vi: hoán đổi nibble swap nibbles (each byte)
zh_hans: 交换 半字节 swap nibbles (each byte)
zh_hant: 交換半位元組 swap nibbles (each byte)

# DataOp_Kind_Clamp
source: Clamp to min/max
ar: التقييد بالحد الأدنى/الأقصى
cs: Omezit na min./max.
de: Auf Min./Max. begrenzen
el: Περιορισμός σε ελάχ./μέγ.
es: Limitar a mín./máx.
fa: محدود کردن به حداقل/حداکثر
fr: Limiter au min./max.
hu: Korlátozás min./max. értékre
id: Batasi ke min/maks
it: Limita a min/max
ja: 最小値・最大値で制限
ko: 최소/최대로 제한
pl: Ogranicz do min./maks.
pt: Limitar a mín./máx.
ro: Limitare la min./max.
th: จำกัดที่ค่าต่ำสุด/สูงสุด
tr: En küçük/en büyüğe sınırla
uk: Обмеження мінімумом/максимумом
vi: Giới hạn trong min/max
zh_hans: 限制在最小值/最大值之间
zh_hant: 限制在最小值/最大值

# Cmd_data_op_clamp
source: Clamp to min/max
ar: التقييد بالحد الأدنى/الأقصى
cs: Omezit na min./max.
de: Auf Min./Max. begrenzen
el: Περιορισμός σε ελάχ./μέγ.
es: Limitar a mín./máx.
fa: محدود کردن به حداقل/حداکثر
fr: Limiter au min./max.
hu: Korlátozás min./max. értékre
id: Batasi ke min/maks
it: Limita a min/max
ja: 最小値・最大値で制限
ko: 최소/최대로 제한
pl: Ogranicz do min./maks.
pt: Limitar a mín./máx.
ro: Limitare la min./max.
th: จำกัดที่ค่าต่ำสุด/สูงสุด
tr: En küçük/en büyüğe sınırla
uk: Обмеження мінімумом/максимумом
vi: Giới hạn trong min/max
zh_hans: 限制在最小值/最大值之间
zh_hant: 限制在最小值/最大值

# CmdAlias_data_op_clamp
source: clamp to min/max
ar: clamp to min/max تقييد حد أدنى أقصى
cs: omezit minimum maximum oříznout oriznout clamp to min/max
de: begrenzen minimum maximum clamp to min/max
el: περιορισμός ελάχιστο μέγιστο clamp to min/max
es: limitar mínimo máximo clamp to min/max
fa: محدود کردن حداقل حداکثر, clamp to min/max
fr: limiter minimum maximum clamp to min/max
hu: korlátozás korlatozas minimum maximum vágás vagas clamp to min/max
id: batasi minimum maksimum clamp to min/max
it: limita minimo massimo clamp to min/max
ja: さいしょうち さいだいち せいげん くらんぷ
ko: 최솟값 최댓값 제한 클램프 clamp to min/max
pl: ogranicz minimum maksimum clamp to min/max
pt: limitar mínimo máximo clamp to min/max
ro: limitare minim maxim clamp to min/max
th: จำกัด ต่ำสุด สูงสุด clamp to min/max
tr: sınırla clamp to min/max
uk: обмежити clamp to min/max
vi: giới hạn nhỏ nhất lớn nhất clamp to min/max
zh_hans: 限制 最小值 最大值 钳位 clamp to min/max
zh_hant: 最小值 最大值 限制 clamp to min/max

# DataOp_Kind_InsertBits
source: Insert bits
ar: إدراج بتات
cs: Vložit bity
de: Bits einfügen
el: Εισαγωγή bit
es: Insertar bits
fa: درج بیت‌ها
fr: Insérer des bits
hu: Bitek beszúrása
id: Sisipkan bit
it: Inserisci bit
ja: ビットを挿入
ko: 비트 삽입
pl: Wstaw bity
pt: Inserir bits
ro: Inserare biți
th: แทรกบิต
tr: Bit ekle
uk: Вставлення бітів
vi: Chèn bit
zh_hans: 插入位
zh_hant: 插入位元

# Cmd_data_op_insertBits
source: Insert bits
ar: إدراج بتات
cs: Vložit bity
de: Bits einfügen
el: Εισαγωγή bit
es: Insertar bits
fa: درج بیت‌ها
fr: Insérer des bits
hu: Bitek beszúrása
id: Sisipkan bit
it: Inserisci bit
ja: ビットを挿入
ko: 비트 삽입
pl: Wstaw bity
pt: Inserir bits
ro: Inserare biți
th: แทรกบิต
tr: Bit ekle
uk: Вставлення бітів
vi: Chèn bit
zh_hans: 插入位
zh_hant: 插入位元

# CmdAlias_data_op_insertBits
source: insert bits
ar: insert bits إدراج بتات
cs: vložit vlozit bity insert bits
de: bits einfügen insert bits
el: εισαγωγή bit insert bits
es: insertar bits insert bits
fa: درج بیت‌ها, insert bits
fr: insérer bits insert bits
hu: bitek beszúrás beszuras insert bits
id: sisipkan bit insert bits
it: inserisci bit insert bits
ja: びっとをそうにゅう
ko: 비트 삽입 추가 insert bits
pl: wstaw bity insert bits
pt: inserir bits insert bits
ro: inserare biți biti insert bits
th: แทรกบิต insert bits
tr: bit ekle insert bits
uk: вставити біти insert bits
vi: chèn bit insert bits
zh_hans: 插入 位 比特 insert bits
zh_hant: 插入位元 insert bits

# DataOp_Kind_DeleteBits
source: Delete bits
ar: حذف بتات
cs: Odstranit bity
de: Bits löschen
el: Διαγραφή bit
es: Eliminar bits
fa: حذف بیت‌ها
fr: Supprimer des bits
hu: Bitek törlése
id: Hapus bit
it: Elimina bit
ja: ビットを削除
ko: 비트 삭제
pl: Usuń bity
pt: Excluir bits
ro: Ștergere biți
th: ลบบิต
tr: Bit sil
uk: Видалення бітів
vi: Xóa bit
zh_hans: 删除位
zh_hant: 刪除位元

# Cmd_data_op_deleteBits
source: Delete bits
ar: حذف بتات
cs: Odstranit bity
de: Bits löschen
el: Διαγραφή bit
es: Eliminar bits
fa: حذف بیت‌ها
fr: Supprimer des bits
hu: Bitek törlése
id: Hapus bit
it: Elimina bit
ja: ビットを削除
ko: 비트 삭제
pl: Usuń bity
pt: Excluir bits
ro: Ștergere biți
th: ลบบิต
tr: Bit sil
uk: Видалення бітів
vi: Xóa bit
zh_hans: 删除位
zh_hant: 刪除位元

# CmdAlias_data_op_deleteBits
source: delete bits
ar: delete bits حذف بتات
cs: odstranit smazat bity delete bits
de: bits löschen delete bits
el: διαγραφή bit delete bits
es: eliminar bits delete bits
fa: حذف بیت‌ها, delete bits
fr: supprimer bits delete bits
hu: bitek törlés torles delete bits
id: hapus bit delete bits
it: elimina bit delete bits
ja: びっとをさくじょ
ko: 비트 삭제 제거 delete bits
pl: usuń bity delete bits
pt: excluir bits delete bits
ro: ștergere stergere biți biti delete bits
th: ลบบิต delete bits
tr: bit sil delete bits
uk: видалити біти delete bits
vi: xóa bit delete bits
zh_hans: 删除 位 比特 delete bits
zh_hant: 刪除位元 delete bits

# DataOp_Category_Arithmetic
source: Arithmetic
ar: حسابية
cs: Aritmetika
de: Arithmetik
el: Αριθμητικές
es: Aritmética
fa: حسابی
fr: Arithmétique
hu: Aritmetikai
id: Aritmetika
it: Aritmetica
ja: 算術
ko: 산술
pl: Arytmetyka
pt: Aritmética
ro: Aritmetică
th: เลขคณิต
tr: Aritmetik
uk: Арифметика
vi: Số học
zh_hans: 算术
zh_hant: 算術

# DataOp_Category_Bitwise
source: Bitwise
ar: عمليات البتات
cs: Bitové operace
de: Bitweise
el: Πράξεις bit
es: Bit a bit
fa: بیتی
fr: Opérations sur les bits
hu: Bitenkénti
it: Bit a bit
ja: ビット演算
ko: 비트 연산
pl: Bitowe
pt: Bit a bit
ro: Pe biți
th: ระดับบิต
tr: Bit düzeyinde
uk: Побітові
vi: Thao tác bit
zh_hans: 按位运算
zh_hant: 位元運算

# DataOp_Category_ShiftRotate
source: Shift / rotate
ar: إزاحة / تدوير
cs: Posun / rotace
de: Schieben / Rotieren
el: Ολίσθηση / περιστροφή
es: Desplazar / rotar
fa: شیفت / چرخش
fr: Décalage / rotation
hu: Biteltolás / forgatás
id: Geser / rotasi
it: Scorrimento / rotazione
ja: シフト・ローテート
ko: 시프트 / 회전
pl: Przesunięcie / rotacja
pt: Deslocamento / rotação
ro: Deplasare / rotire
th: เลื่อน / หมุน
tr: Kaydır / döndür
uk: Зсув / циклічний зсув
vi: Dịch / xoay
zh_hans: 移位/循环移位
zh_hant: 位移/旋轉

# DataOp_Category_Reorder
source: Reorder
ar: إعادة الترتيب
cs: Změna pořadí
de: Neu anordnen
el: Αναδιάταξη
es: Reordenar
fa: تغییر ترتیب
fr: Réorganiser
hu: Átrendezés
id: Urutkan ulang
it: Riordino
ja: 並べ替え
ko: 순서 변경
pl: Zmiana kolejności
pt: Reordenar
ro: Reordonare
th: จัดลำดับใหม่
tr: Yeniden sırala
uk: Перестановка
vi: Sắp xếp lại
zh_hans: 重新排列
zh_hant: 重新排列

# DataOp_Category_Clamp
source: Clamp
ar: تقييد
cs: Omezení
de: Begrenzen
el: Περιορισμός
es: Limitar
fa: محدود کردن
fr: Limiter
hu: Korlátozás
id: Batasi
it: Limitazione
ja: 制限
ko: 제한
pl: Ograniczanie
pt: Limitar
ro: Limitare
th: จำกัดค่า
tr: Sınırla
uk: Обмеження
vi: Giới hạn
zh_hans: 限制
zh_hant: 限制

# DataOp_Category_BitInsertDelete
source: Insert / delete bits
ar: إدراج / حذف البتات
cs: Vložení / odstranění bitů
de: Bits einfügen / löschen
el: Εισαγωγή / διαγραφή bit
es: Insertar / eliminar bits
fa: درج / حذف بیت‌ها
fr: Insérer / supprimer des bits
hu: Bitek beszúrása / törlése
id: Sisipkan / hapus bit
it: Inserisci / elimina bit
ja: ビットの挿入・削除
ko: 비트 삽입 / 삭제
pl: Wstaw / usuń bity
pt: Inserir / excluir bits
ro: Inserare / ștergere biți
th: แทรก / ลบบิต
tr: Bit ekle / sil
uk: Вставлення / видалення бітів
vi: Chèn / xóa bit
zh_hans: 插入/删除位
zh_hant: 插入/刪除位元

# CmdCategory_data
source: Data
ar: البيانات
de: Daten
el: Δεδομένα
es: Datos
fa: داده
fr: Données
hu: Adatok
it: Dati
ja: データ
ko: 데이터
pl: Dane
pt: Dados
ro: Date
th: ข้อมูล
tr: Veri
uk: Дані
vi: Dữ liệu
zh_hans: 数据
zh_hant: 資料

# CmdCategory_dataOperation
source: Data operation
ar: عملية بيانات
cs: Datová operace
de: Datenoperation
el: Πράξη δεδομένων
es: Operación de datos
fa: عملیات داده
fr: Opération sur les données
hu: Adatművelet
id: Operasi data
it: Operazione sui dati
ja: データ演算
ko: 데이터 연산
pl: Operacja na danych
pt: Operação de dados
ro: Operație pe date
th: การดำเนินการข้อมูล
tr: Veri işlemi
uk: Операція з даними
vi: Phép toán dữ liệu
zh_hans: 数据运算
zh_hant: 資料運算

# Cmd_data_operation
source: Data operations...
ar: عمليات البيانات...
cs: Datové operace...
de: Datenoperationen...
el: Πράξεις δεδομένων...
es: Operaciones de datos...
fa: عملیات داده...
fr: Opérations sur les données...
hu: Adatműveletek...
id: Operasi data...
it: Operazioni sui dati...
ja: データ演算...
ko: 데이터 연산...
pl: Operacje na danych...
pt: Operações de dados...
ro: Operații pe date...
th: การดำเนินการข้อมูล...
tr: Veri işlemleri...
uk: Операції з даними...
vi: Phép toán dữ liệu...
zh_hans: 数据运算...
zh_hant: 資料運算...

# CmdAlias_data_operation
source: arithmetic xor shift rotate swap
ar: arithmetic xor shift rotate swap عمليات حسابية إزاحة تدوير تبديل
cs: datové datove operace aritmetika výpočet vypocet posun rotace prohodit arithmetic xor shift rotate swap
de: arithmetik schieben rotieren tauschen arithmetic xor shift rotate swap
el: αριθμητική πράξη υπολογισμός arithmetic xor shift rotate swap
es: aritmética desplazar rotar intercambiar arithmetic xor shift rotate swap
fa: عملیات حسابی محاسبه, arithmetic xor shift rotate swap
fr: arithmétique décalage rotation permuter arithmetic xor shift rotate swap
hu: adatművelet adatmuvelet művelet muvelet számítás szamitas arithmetic xor shift rotate swap
id: operasi hitung aritmetika arithmetic xor shift rotate swap
it: aritmetica xor scorrimento rotazione scambia arithmetic xor shift rotate swap
ja: でーためんざん えんざん けいさん
ko: 데이터 연산 계산 산술 시프트 회전 스왑 arithmetic xor shift rotate swap
pl: arytmetyka xor przesuń obróć zamień arithmetic xor shift rotate swap
pt: aritmética xor deslocar rotacionar trocar arithmetic xor shift rotate swap
ro: operație operatie aritmetică aritmetica calcul deplasare rotire arithmetic xor shift rotate swap
th: การดำเนินการ คำนวณ เลขคณิต arithmetic xor shift rotate swap
tr: aritmetik kaydır döndür takas arithmetic xor shift rotate swap
uk: арифметика зсув перестановка arithmetic xor shift rotate swap
vi: phép toán tính toán số học arithmetic xor shift rotate swap
zh_hans: 数据运算 运算 计算 算术 异或 移位 交换 arithmetic xor shift rotate swap
zh_hant: 資料運算 運算 計算 arithmetic xor shift rotate swap

# Cmd_data_repeatOperation
source: Repeat last data operation
ar: تكرار آخر عملية بيانات
cs: Opakovat poslední datovou operaci
de: Letzte Datenoperation wiederholen
el: Επανάληψη τελευταίας πράξης δεδομένων
es: Repetir la última operación de datos
fa: تکرار آخرین عملیات داده
fr: Répéter la dernière opération sur les données
hu: Utolsó adatművelet ismétlése
id: Ulangi operasi data terakhir
it: Ripeti ultima operazione sui dati
ja: 前回のデータ演算を繰り返す
ko: 마지막 데이터 연산 반복
pl: Powtórz ostatnią operację na danych
pt: Repetir última operação de dados
ro: Repetare ultima operație pe date
th: ทำการดำเนินการข้อมูลล่าสุดซ้ำ
tr: Son veri işlemini yinele
uk: Повторити останню операцію з даними
vi: Lặp lại phép toán dữ liệu gần nhất
zh_hans: 重复上次数据运算
zh_hant: 重複上次的資料運算

# CmdAlias_data_repeatOperation
source: again repeat
ar: again repeat تكرار مرة أخرى
cs: znovu opakovat again repeat
de: erneut wiederholen again repeat
el: ξανά επανάληψη again repeat
es: otra vez repetir again repeat
fa: تکرار دوباره, again repeat
fr: encore répéter again repeat
hu: ismétlés ismetles újra ujra utolsó utolso adatművelet again repeat
id: ulangi lagi again repeat
it: ancora ripeti again repeat
ja: ぜんかいのでーたえんざんをくりかえす
ko: 마지막 데이터 연산 반복 다시 again repeat
pl: ponownie powtórz again repeat
pt: novamente repetir again repeat
ro: din nou repetare again repeat
th: ทำซ้ำ อีกครั้ง again repeat
tr: yeniden yinele again repeat
uk: знову повторити again repeat
vi: lặp lại lần nữa again repeat
zh_hans: 重复 再次 上次 数据运算 again repeat
zh_hant: 重複上次的資料運算 再次 again repeat

# Menu_Data.Title
source: Data
ar: البيانات
de: Daten
el: Δεδομένα
es: Datos
fa: داده
fr: Données
hu: Adatok
it: Dati
ja: データ(D)
ko: 데이터(D)
pl: Dane
pt: Dados
ro: Date
th: ข้อมูล(D)
tr: Veri
uk: Дані
vi: Dữ liệu
zh_hans: 数据(D)
zh_hant: 資料(D)

# Menu_Data.AccessKey
source: D
ar: ي
de: T
el: Δ
fa: د
hu: A
tr: V
uk: Н

# Menu_Data_Operation.Text
source: Data operations...
ar: عمليات البيانات...
cs: Datové operace...
de: Datenoperationen...
el: Πράξεις δεδομένων...
es: Operaciones de datos...
fa: عملیات داده...
fr: Opérations sur les données...
hu: Adatműveletek...
id: Operasi Data...
it: Operazioni sui dati...
ja: データ演算(O)...
ko: 데이터 연산(O)...
pl: Operacje na danych...
pt: Operações de dados...
ro: Operații pe date...
th: การดำเนินการข้อมูล(O)...
tr: Veri işlemleri...
uk: Операції з даними...
vi: Phép toán Dữ liệu...
zh_hans: 数据运算(O)...
zh_hant: 資料運算(O)...

# Menu_Data_Operation.AccessKey
source: O
ar: ع
cs: D
de: D
el: Π
fa: ع
hu: A
tr: I
uk: О
vi: P
